#-*- coding:utf-8 -*-

import re
import random
HOMERU_TEXT = [u"「さすが{name}っ！おれたちにできない事を平然とやってのけるッ　そこにシビれる！あこがれるゥ！」",
        u"{name}さん、素敵です！",
        u"シブイねェ…まったくおたくシブイぜ",
        u"お前がガンダムだ！",
        u"ええぃ！連邦軍の{name}は化け物か！"
        ]

RUIZU = u"{name}！{name}！{name}！{name}ぅぅうううわぁああああああああああああああああああああああん！！！\nあぁああああ…ああ…あっあっー！あぁああああああ！！！{name}{name}{name}ぅううぁわぁああああ！！！\nあぁクンカクンカ！クンカクンカ！スーハースーハー！スーハースーハー！いい匂いだなぁ…くんくん\nんはぁっ！{name}・フランソワーズたんの桃色ブロンドの髪をクンカクンカしたいお！クンカクンカ！あぁあ！！\n間違えた！モフモフしたいお！モフモフ！モフモフ！髪髪モフモフ！カリカリモフモフ…きゅんきゅんきゅい！！\n小説12巻の{name}たんかわいかったよぅ！！あぁぁああ…あああ…あっあぁああああ！！ふぁぁあああんんっ！！\nアニメ2期放送されて良かったね{name}たん！あぁあああああ！かわいい！{name}たん！かわいい！あっああぁああ！\nコミック2巻も発売されて嬉し…いやぁああああああ！！！にゃああああああああん！！ぎゃああああああああ！！\nぐあああああああああああ！！！コミックなんて現実じゃない！！！！あ…小説もアニメもよく考えたら…\nル イ ズ ち ゃ ん は 現実 じ ゃ な い？にゃあああああああああああああん！！うぁああああああああああ！！\nそんなぁああああああ！！いやぁぁぁあああああああああ！！はぁああああああん！！ハルケギニアぁああああ！！\nこの！ちきしょー！やめてやる！！現実なんかやめ…て…え！？見…てる？表紙絵の{name}ちゃんが僕を見てる？\n表紙絵の{name}ちゃんが僕を見てるぞ！{name}ちゃんが僕を見てるぞ！挿絵の{name}ちゃんが僕を見てるぞ！！\nアニメの{name}ちゃんが僕に話しかけてるぞ！！！よかった…世の中まだまだ捨てたモンじゃないんだねっ！\nいやっほぉおおおおおおお！！！僕には{name}ちゃんがいる！！やったよケティ！！ひとりでできるもん！！！\nあ、コミックの{name}ちゃああああああああああああああん！！いやぁあああああああああああああああ！！！！\nあっあんああっああんあアン様ぁあ！！シ、シエスター！！アンリエッタぁああああああ！！！タバサｧぁあああ！！\nううっうぅうう！！俺の想いよ{name}へ届け！！ハルゲニアの{name}へ届け"

def handle(msg, event):
    if event == u"RECEIVED":
        if re.match(u'\#HOMERO', msg.Body):
            random.shuffle(HOMERU_TEXT)
            text = HOMERU_TEXT[0].format(name = msg.FromDisplayName)
            msg.Chat.SendMessage(text)
        elif re.match(u'#ルイズ',msg.Body):
            text = RUIZU.format(name = msg.FromDisplayName)
            msg.Chat.SendMessage(text)
